In [2]:
import pandas as pd
import ast

listings_path = "../data_raw/listings.csv"
reviews_path = "../data_raw/reviews.csv"

df_listings_raw = pd.read_csv(listings_path, encoding="ISO-8859-1", low_memory=False)
df_reviews_raw  = pd.read_csv(reviews_path,  encoding="ISO-8859-1", low_memory=False)

print(df_listings_raw.shape)
print(df_reviews_raw.shape)

(279712, 33)
(5373143, 4)

In [3]:
print(len(df_listings_raw.columns))
print(df_listings_raw.columns.tolist())

33
['listing_id', 'name', 'host_id', 'host_since', 'host_location', 'host_response_time', 'host_response_rate', 'host_acceptance_rate', 'host_is_superhost', 'host_total_listings_count', 'host_has_profile_pic', 'host_identity_verified', 'neighbourhood', 'district', 'city', 'latitude', 'longitude', 'property_type', 'room_type', 'accommodates', 'bedrooms', 'amenities', 'price', 'minimum_nights', 'maximum_nights', 'review_scores_rating', 'review_scores_accuracy', 'review_scores_cleanliness', 'review_scores_checkin', 'review_scores_communication', 'review_scores_location', 'review_scores_value', 'instant_bookable']

In [4]:
listing_cols = [
    "listing_id",
    "name",
    "host_id",
    "property_type",
    "room_type",
    "accommodates",
    "bedrooms",
    "amenities",        # keep raw text
    "price",
    "minimum_nights",
    "maximum_nights",
    "instant_bookable"
]

df_listings = df_listings_raw[listing_cols].copy()
df_listings.head()

,listing_id,name,host_id,property_type,room_type,accommodates,bedrooms,amenities,price,minimum_nights,maximum_nights,instant_bookable
0,281420,"Beautiful Flat in le Village Montmartre, Paris",1466919,Entire apartment,Entire place,2,1.0,"[""Heating"", ""Kitchen"", ""Washer"", ""Wifi"", ""Long...",53,2,1125,f
1,3705183,39 mÃÂ² Paris (Sacre CÃ âur),10328771,Entire apartment,Entire place,2,1.0,"[""Shampoo"", ""Heating"", ""Kitchen"", ""Essentials""...",120,2,1125,f
2,4082273,"Lovely apartment with Terrace, 60m2",19252768,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Washer"", ""Wifi"",...",89,2,1125,f
3,4797344,Cosy studio (close to Eiffel tower),10668311,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Wifi"", ""Long ter...",58,2,1125,f
4,4823489,Close to Eiffel Tower - Beautiful flat : 2 rooms,24837558,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Essentials"", ""Ha...",60,2,1125,f

In [5]:
host_cols = [
    "host_id",
    "host_since",
    "host_location",
    "host_response_time",
    "host_response_rate",
    "host_acceptance_rate",
    "host_is_superhost",
    "host_total_listings_count",
    "host_has_profile_pic",
    "host_identity_verified"
]

df_hosts = df_listings_raw[host_cols].drop_duplicates(subset=["host_id"]).reset_index(drop=True)
df_hosts.head()

,host_id,host_since,host_location,host_response_time,host_response_rate,host_acceptance_rate,host_is_superhost,host_total_listings_count,host_has_profile_pic,host_identity_verified
0,1466919,2011-12-03,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f
1,10328771,2013-11-29,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,t
2,19252768,2014-07-31,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f
3,10668311,2013-12-17,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,t
4,24837558,2014-12-14,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f

In [6]:
location_cols = [
    "listing_id",
    "neighbourhood",
    "district",
    "city",
    "latitude",
    "longitude"
]

df_location = df_listings_raw[location_cols].copy()
df_location.head()

   listing_id      neighbourhood district   city  latitude  longitude
0      281420  Buttes-Montmartre      NaN  Paris  48.88668    2.33343
1     3705183  Buttes-Montmartre      NaN  Paris  48.88617    2.34515
2     4082273             Elysee      NaN  Paris  48.88112    2.31712
3     4797344          Vaugirard      NaN  Paris  48.84571    2.30584
4     4823489              Passy      NaN  Paris  48.85500    2.26979

In [7]:
review_scores_cols = [
    "listing_id",
    "review_scores_rating",
    "review_scores_accuracy",
    "review_scores_cleanliness",
    "review_scores_checkin",
    "review_scores_communication",
    "review_scores_location",
    "review_scores_value"
]

df_review_scores = df_listings_raw[review_scores_cols].copy()
df_review_scores.head()

,listing_id,review_scores_rating,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value
0,281420,100.0,10.0,10.0,10.0,10.0,10.0,10.0
1,3705183,100.0,10.0,10.0,10.0,10.0,10.0,10.0
2,4082273,100.0,10.0,10.0,10.0,10.0,10.0,10.0
3,4797344,100.0,10.0,10.0,10.0,10.0,10.0,10.0
4,4823489,100.0,10.0,10.0,10.0,10.0,10.0,10.0

In [8]:
# Handle missing values first
df_listings_raw["amenities"] = df_listings_raw["amenities"].fillna("[]")

# Convert string list to actual Python list
def parse_amenities(x):
    try:
        return ast.literal_eval(x)
    except Exception:
        # fallback: remove brackets and split by comma
        x = x.strip("[]")
        if not x:
            return []
        return [item.strip().strip('"').strip("'") for item in x.split(",")]

df_listings_raw["amenities_list"] = df_listings_raw["amenities"].apply(parse_amenities)

# Explode to one row per (listing_id, amenity_name)
df_amenities_exploded = (
    df_listings_raw[["listing_id", "amenities_list"]]
      .explode("amenities_list")
      .rename(columns={"amenities_list": "amenity_name"})
)

# Drop blanks
df_amenities_exploded["amenity_name"] = (
    df_amenities_exploded["amenity_name"]
    .astype(str)
    .str.strip()
)

df_amenities_exploded = df_amenities_exploded[
    df_amenities_exploded["amenity_name"].notna() &
    (df_amenities_exploded["amenity_name"] != "") &
    (df_amenities_exploded["amenity_name"] != "nan")
]

df_amenities_exploded.head()

   listing_id             amenity_name
0      281420                  Heating
0      281420                  Kitchen
0      281420                   Washer
0      281420                     Wifi
0      281420  Long term stays allowed

In [9]:
unique_amenities = (
    df_amenities_exploded["amenity_name"]
    .drop_duplicates()
    .sort_values()
    .reset_index(drop=True)
)

df_amenities = pd.DataFrame({
    "amenity_id": range(1, len(unique_amenities) + 1),
    "amenity_name": unique_amenities
})

df_amenities.head()

   amenity_id                                       amenity_name
0           1  "thankyou", a  blend of natural oils, botanica...
1           2                                     .. conditioner
2           3                            02 Bocas electric stove
3           4                         02 bocas c/forno gas stove
4           5                         04 bocas c/forno gas stove

In [10]:
df_listing_amenities = (
    df_amenities_exploded
      .merge(df_amenities, on="amenity_name", how="left")
      [["listing_id", "amenity_id"]]
      .drop_duplicates()
      .reset_index(drop=True)
)

df_listing_amenities.head()

   listing_id  amenity_id
0      281420        1536
1      281420        1663
2      281420        2893
3      281420        2923
4      281420        1770

In [11]:
df_reviews = df_reviews_raw.copy()

# Optionally, parse date to proper datetime now or in cleaning step
df_reviews["date"] = pd.to_datetime(df_reviews["date"], format="%d-%m-%y", errors="coerce")

df_reviews.head()

   listing_id  review_id date  reviewer_id
0       11798  330265172  NaT     11863072
1       15383  330103585  NaT     39147453
2       16455  329985788  NaT      1125378
3       17919  330016899  NaT    172717984
4       26827  329995638  NaT     17542859

In [12]:
out_path = "../data_processed/"

df_listings.to_csv(out_path + "listings.csv", index=False)
df_hosts.to_csv(out_path + "hosts.csv", index=False)
df_location.to_csv(out_path + "location.csv", index=False)
df_review_scores.to_csv(out_path + "review_scores.csv", index=False)
df_amenities.to_csv(out_path + "amenities.csv", index=False)
df_listing_amenities.to_csv(out_path + "listing_amenities.csv", index=False)
df_reviews.to_csv(out_path + "reviews.csv", index=False)

In [14]:
import pandas as pd
import numpy as np

base_path = "../data_processed/"

df_listings = pd.read_csv(base_path + "listings.csv", low_memory=False)
df_hosts = pd.read_csv(base_path + "hosts.csv", low_memory=False)
df_location = pd.read_csv(base_path + "location.csv", low_memory=False)
df_review_scores = pd.read_csv(base_path + "review_scores.csv", low_memory=False)
df_amenities = pd.read_csv(base_path + "amenities.csv", low_memory=False)
df_listing_amenities = pd.read_csv(base_path + "listing_amenities.csv", low_memory=False)
df_reviews = pd.read_csv(base_path + "reviews.csv", low_memory=False)

df_listings.shape, df_reviews.shape

((279712, 12), (5373143, 4))

In [15]:
df_listings.info()
df_listings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279712 entries, 0 to 279711
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   listing_id        279712 non-null  int64
 1   name              279537 non-null  object
 2   host_id           279712 non-null  int64
 3   property_type     279712 non-null  object
 4   room_type         279712 non-null  object
 5   accommodates      279712 non-null  int64
 6   bedrooms          250277 non-null  float64
 7   amenities         279712 non-null  object
 8   price             279712 non-null  int64
 9   minimum_nights    279712 non-null  int64
 10  maximum_nights    279712 non-null  int64
 11  instant_bookable  279712 non-null  object
dtypes: float64(1), int64(6), object(5)
memory usage: 25.6+ MB

,listing_id,name,host_id,property_type,room_type,accommodates,bedrooms,amenities,price,minimum_nights,maximum_nights,instant_bookable
0,281420,"Beautiful Flat in le Village Montmartre, Paris",1466919,Entire apartment,Entire place,2,1.0,"[""Heating"", ""Kitchen"", ""Washer"", ""Wifi"", ""Long...",53,2,1125,f
1,3705183,39 mÃÂ² Paris (Sacre CÃ âur),10328771,Entire apartment,Entire place,2,1.0,"[""Shampoo"", ""Heating"", ""Kitchen"", ""Essentials""...",120,2,1125,f
2,4082273,"Lovely apartment with Terrace, 60m2",19252768,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Washer"", ""Wifi"",...",89,2,1125,f
3,4797344,Cosy studio (close to Eiffel tower),10668311,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Wifi"", ""Long ter...",58,2,1125,f
4,4823489,Close to Eiffel Tower - Beautiful flat : 2 rooms,24837558,Entire apartment,Entire place,2,1.0,"[""Heating"", ""TV"", ""Kitchen"", ""Essentials"", ""Ha...",60,2,1125,f

In [16]:
def clean_price(x):
    if pd.isna(x):
        return np.nan
    x = str(x)
    # Remove currency symbols and commas
    x = x.replace("$", "").replace("€", "").replace("£", "").replace(",", "").strip()
    # Some might have spaces or extra text, keep first token
    x = x.split(" ")[0]
    try:
        return float(x)
    except:
        return np.nan

df_listings["price"] = df_listings["price"].apply(clean_price)

df_listings["price"].describe()

count    279712.000000
mean        608.792737
std        3441.826611
min           0.000000
25%          75.000000
50%         150.000000
75%         474.000000
max      625216.000000
Name: price, dtype: float64

In [17]:
num_cols = ["accommodates", "bedrooms", "minimum_nights", "maximum_nights"]

for col in num_cols:
    df_listings[col] = pd.to_numeric(df_listings[col], errors="coerce")

df_listings[num_cols].describe()

        accommodates       bedrooms  minimum_nights  maximum_nights
count  279712.000000  250277.000000   279712.000000    2.797120e+05
mean        3.288736       1.515509        8.050967    2.755860e+04
std         2.133379       1.153080       31.518946    7.282875e+06
min         0.000000       1.000000        1.000000    1.000000e+00
25%         2.000000       1.000000        1.000000    4.500000e+01
50%         2.000000       1.000000        2.000000    1.125000e+03
75%         4.000000       2.000000        5.000000    1.125000e+03
max        16.000000      50.000000     9999.000000    2.147484e+09

In [18]:
df_listings["listing_id"] = pd.to_numeric(df_listings["listing_id"], errors="coerce").astype("Int64")
df_listings["host_id"] = pd.to_numeric(df_listings["host_id"], errors="coerce").astype("Int64")

# instant_bookable is often 't'/'f' or 'True'/'False'
df_listings["instant_bookable"] = df_listings["instant_bookable"].astype(str).str.lower().map({
    "t": True,
    "f": False,
    "true": True,
    "false": False
})

In [19]:
df_listings.isna().mean().sort_values(ascending=False).head(10)

bedrooms          0.105233
name              0.000626
host_id           0.000000
listing_id        0.000000
property_type     0.000000
room_type         0.000000
accommodates      0.000000
amenities         0.000000
price             0.000000
minimum_nights    0.000000
dtype: float64

In [20]:
df_hosts.info()
df_hosts.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 182024 entries, 0 to 182023
Data columns (total 10 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   host_id                    182024 non-null  int64
 1   host_since                 181901 non-null  object
 2   host_location              181345 non-null  object
 3   host_response_time         73735 non-null   object
 4   host_response_rate         73735 non-null   float64
 5   host_acceptance_rate       86036 non-null   float64
 6   host_is_superhost          181901 non-null  object
 7   host_total_listings_count  181901 non-null  float64
 8   host_has_profile_pic       181901 non-null  object
 9   host_identity_verified     181901 non-null  object
dtypes: float64(3), int64(1), object(6)
memory usage: 13.9+ MB

,host_id,host_since,host_location,host_response_time,host_response_rate,host_acceptance_rate,host_is_superhost,host_total_listings_count,host_has_profile_pic,host_identity_verified
0,1466919,2011-12-03,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f
1,10328771,2013-11-29,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,t
2,19252768,2014-07-31,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f
3,10668311,2013-12-17,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,t
4,24837558,2014-12-14,"Paris, Ile-de-France, France",NaN,NaN,NaN,f,1.0,t,f

In [21]:
df_hosts["host_since"] = pd.to_datetime(df_hosts["host_since"], format="%d-%m-%y", errors="coerce")

In [22]:
pct_cols = ["host_response_rate", "host_acceptance_rate"]

for col in pct_cols:
    df_hosts[col] = (
        df_hosts[col]
        .astype(str)
        .str.replace("%", "", regex=False)
        .str.strip()
    )
    df_hosts[col] = pd.to_numeric(df_hosts[col], errors="coerce")

In [23]:
bool_cols = ["host_is_superhost", "host_has_profile_pic", "host_identity_verified"]

for col in bool_cols:
    df_hosts[col] = df_hosts[col].astype(str).str.lower().map({
        "t": True,
        "f": False,
        "true": True,
        "false": False
    })

df_hosts["host_id"] = pd.to_numeric(df_hosts["host_id"], errors="coerce").astype("Int64")
df_hosts["host_total_listings_count"] = pd.to_numeric(df_hosts["host_total_listings_count"], errors="coerce")

In [24]:
df_location.info()
df_location.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279712 entries, 0 to 279711
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   listing_id     279712 non-null  int64
 1   neighbourhood  279712 non-null  object
 2   district       37012 non-null   object
 3   city           279712 non-null  object
 4   latitude       279712 non-null  float64
 5   longitude      279712 non-null  float64
dtypes: float64(2), int64(1), object(3)
memory usage: 12.8+ MB

   listing_id      neighbourhood district   city  latitude  longitude
0      281420  Buttes-Montmartre      NaN  Paris  48.88668    2.33343
1     3705183  Buttes-Montmartre      NaN  Paris  48.88617    2.34515
2     4082273             Elysee      NaN  Paris  48.88112    2.31712
3     4797344          Vaugirard      NaN  Paris  48.84571    2.30584
4     4823489              Passy      NaN  Paris  48.85500    2.26979

In [25]:
df_location["listing_id"] = pd.to_numeric(df_location["listing_id"], errors="coerce").astype("Int64")
df_location["latitude"] = pd.to_numeric(df_location["latitude"], errors="coerce")
df_location["longitude"] = pd.to_numeric(df_location["longitude"], errors="coerce")

In [26]:
df_location["city"] = df_location["city"].astype(str).str.strip()
df_location["neighbourhood"] = df_location["neighbourhood"].astype(str).str.strip()
df_location["district"] = df_location["district"].astype(str).str.strip()

In [27]:
df_review_scores.info()
df_review_scores.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 279712 entries, 0 to 279711
Data columns (total 8 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   listing_id                   279712 non-null  int64
 1   review_scores_rating         188307 non-null  float64
 2   review_scores_accuracy       187999 non-null  float64
 3   review_scores_cleanliness    188047 non-null  float64
 4   review_scores_checkin        187941 non-null  float64
 5   review_scores_communication  188025 non-null  float64
 6   review_scores_location       187937 non-null  float64
 7   review_scores_value          187927 non-null  float64
dtypes: float64(7), int64(1)
memory usage: 17.1 MB

,listing_id,review_scores_rating,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value
0,281420,100.0,10.0,10.0,10.0,10.0,10.0,10.0
1,3705183,100.0,10.0,10.0,10.0,10.0,10.0,10.0
2,4082273,100.0,10.0,10.0,10.0,10.0,10.0,10.0
3,4797344,100.0,10.0,10.0,10.0,10.0,10.0,10.0
4,4823489,100.0,10.0,10.0,10.0,10.0,10.0,10.0

In [28]:
df_review_scores["listing_id"] = pd.to_numeric(df_review_scores["listing_id"], errors="coerce").astype("Int64")

score_cols = [
    "review_scores_rating",
    "review_scores_accuracy",
    "review_scores_cleanliness",
    "review_scores_checkin",
    "review_scores_communication",
    "review_scores_location",
    "review_scores_value"
]

for col in score_cols:
    df_review_scores[col] = pd.to_numeric(df_review_scores[col], errors="coerce")

df_review_scores[score_cols].describe()

,review_scores_rating,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value
count,188307.000000,187999.000000,188047.000000,187941.000000,188025.000000,187937.000000,187927.000000
mean,93.405195,9.565476,9.312869,9.701534,9.698593,9.633994,9.335364
std,10.070437,0.990878,1.146072,0.867434,0.886884,0.833234,1.042625
min,20.000000,2.000000,2.000000,2.000000,2.000000,2.000000,2.000000
25%,91.000000,9.000000,9.000000,10.000000,10.000000,9.000000,9.000000
50%,96.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
75%,100.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
max,100.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000

In [29]:
df_reviews.info()
df_reviews.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5373143 entries, 0 to 5373142
Data columns (total 4 columns):
 #   Column       Dtype
---  ------       -----
 0   listing_id   int64
 1   review_id    int64
 2   date         object
 3   reviewer_id  int64
dtypes: int64(3), object(1)
memory usage: 164.0+ MB

   listing_id  review_id        date  reviewer_id
0       11798  330265172  2018-09-30     11863072
1       15383  330103585  2018-09-30     39147453
2       16455  329985788  2018-09-30      1125378
3       17919  330016899  2018-09-30    172717984
4       26827  329995638  2018-09-30     17542859

In [30]:
df_reviews["listing_id"] = pd.to_numeric(df_reviews["listing_id"], errors="coerce").astype("Int64")
df_reviews["review_id"] = pd.to_numeric(df_reviews["review_id"], errors="coerce").astype("Int64")
df_reviews["reviewer_id"] = pd.to_numeric(df_reviews["reviewer_id"], errors="coerce").astype("Int64")

# Date format in your sample was '30-09-18'
df_reviews["date"] = pd.to_datetime(df_reviews["date"], format="%d-%m-%y", errors="coerce")

In [31]:
df_reviews["date"].describe()

count      0
mean     NaT
min      NaT
25%      NaT
50%      NaT
75%      NaT
max      NaT
Name: date, dtype: object

In [32]:
df_amenities.info()
df_amenities.head()

df_listing_amenities.info()
df_listing_amenities.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3443 entries, 0 to 3442
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   amenity_id    3443 non-null   int64
 1   amenity_name  3443 non-null   object
dtypes: int64(1), object(1)
memory usage: 53.9+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5470389 entries, 0 to 5470388
Data columns (total 2 columns):
 #   Column      Dtype
---  ------      -----
 0   listing_id  int64
 1   amenity_id  int64
dtypes: int64(2)
memory usage: 83.5 MB

   listing_id  amenity_id
0      281420        1536
1      281420        1663
2      281420        2893
3      281420        2923
4      281420        1770

In [33]:
df_amenities["amenity_id"] = pd.to_numeric(df_amenities["amenity_id"], errors="coerce").astype("Int64")
df_amenities["amenity_name"] = df_amenities["amenity_name"].astype(str).str.strip()

df_listing_amenities["listing_id"] = pd.to_numeric(df_listing_amenities["listing_id"], errors="coerce").astype("Int64")
df_listing_amenities["amenity_id"] = pd.to_numeric(df_listing_amenities["amenity_id"], errors="coerce").astype("Int64")

In [35]:
clean_path = "../data_clean/"

df_listings.to_csv(clean_path + "listings_clean.csv", index=False)
df_hosts.to_csv(clean_path + "hosts_clean.csv", index=False)
df_location.to_csv(clean_path + "location_clean.csv", index=False)
df_review_scores.to_csv(clean_path + "review_scores_clean.csv", index=False)
df_amenities.to_csv(clean_path + "amenities_clean.csv", index=False)
df_listing_amenities.to_csv(clean_path + "listing_amenities_clean.csv", index=False)
df_reviews.to_csv(clean_path + "reviews_clean.csv", index=False)